In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
python_series = ['monday', 'tuesday', 'wenesday', 'thursday', 'friday', 'saturday', 'sunday']
python_series

['monday', 'tuesday', 'wenesday', 'thursday', 'friday', 'saturday', 'sunday']

In [3]:
test_series = pd.Series(python_series, index=['1 day','2 day','3 day','4 day','5 day','6 day','7 day'])
test_series

1 day      monday
2 day     tuesday
3 day    wenesday
4 day    thursday
5 day      friday
6 day    saturday
7 day      sunday
dtype: object

In [6]:
test_series['1 day']

'monday'

In [10]:
df = pd.DataFrame({
    'Name of day': python_series,
    'Type of day': ['working', 'working', 'working', 'working', 'working', 'holiday', 'holiday']
})
df

  Name of day Type of day
0      monday     working
1     tuesday     working
2    wenesday     working
3    thursday     working
4      friday     working
5    saturday     holiday
6      sunday     holiday

In [12]:
sales = pd.read_csv('!Study/sales.csv')
sales.head()

   sales_id  time_id  product_id  region_id  transaction_amount
0         4      868         227        154              -39864
1         5      436         684        724               79272
2         6      529         176        478              -33632
3         7      146          16        891               87806
4         8      483         657        790               98243

In [13]:
products = pd.read_csv('!Study/products.csv')
time = pd.read_csv('!Study/time.csv')

In [14]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   sales_id            1000 non-null   int64
 1   time_id             1000 non-null   int64
 2   product_id          1000 non-null   int64
 3   region_id           1000 non-null   int64
 4   transaction_amount  1000 non-null   int64
dtypes: int64(5)
memory usage: 39.2 KB

In [15]:
sales.columns

Index(['sales_id', 'time_id', 'product_id', 'region_id', 'transaction_amount'], dtype='object')

In [16]:
sales['transaction_amount']

0     -39864
1      79272
2     -33632
3      87806
4      98243
       ...
995    94708
996   -68442
997    69121
998    53607
999    83106
Name: transaction_amount, Length: 1000, dtype: int64

In [17]:
sales[sales['transaction_amount'] >= 8000].sort_values('transaction_amount')

     sales_id  time_id  product_id  region_id  transaction_amount
382       386      623         108        848                8046
67         71      479         956        702                8053
762       766      974         769        915                8123
251       255      531         156        925                8227
86         90      202         200        748                8700
..        ...      ...         ...        ...                 ...
178       182      908         786         16               98752
881       885      563          89        721               98761
772       776       82         954        159               98843
534       538       22         308        737               99651
38         42      139          83        400               99709

[453 rows x 5 columns]

In [19]:
products[(products['product_name'].str.contains('^C')) | (products['product_name'].str.contains('^T'))]

     product_id                 product_name  product_description
4             5           Cheese Cloth No 60                  NaN
6             7         Cinnamon Buns Sticky                  NaN
8             9              Chicken - Bones                  NaN
16           17        Corn Kernels - Frozen                  NaN
21           22      Chips - Potato Jalapeno                  NaN
..          ...                          ...                  ...
978         979        Coffee - Beans, Whole                  NaN
982         983                      Calaloo                  NaN
986         987          Tuna - Salad Premix                  NaN
987         988  Tomatoes - Yellow Hot House                  NaN
990         991     Chestnuts - Whole,canned                  NaN

[219 rows x 3 columns]